**University:** ITMO University  
**Faculty:** [FTMI]  
**Course:** Облачные платформы как основа технологического предпринимательства  
**Year:** 2025/2026  
**Group:** U4125  
**Author:** Barvinok Vsevolod Vladimirovich  
**Lab:** Lab4  
**Date of create:** 07.05.2026  
**Date of finished:** 08.05.2026 

## Отчет по лабораторной работе "№4 "Разработка инфраструктуры MVP AI приложения""  
## Ход работы

### 1. Создать прототип AI-приложения с базовой функциональностью
Приложение: прототип AI-приложения с отслеживанием состояния человека (эмоциональное, ментальное и физическое по некоторым параметрам) и предоставление рекомендаций на основе базы знаний  
AI-компонент: именно предоставление рекомендаций на основе базы знаний и, возможно, собирающихся актуальных данных  
  
Функциональные вероятные модули:
Frontend (что видно): анкета состояния, кнопки выставления эмоций, экран выдачи рекомендаций по запросу, история (? - возможно сократит затраты на выдачу рекомендаций)  
Backend (что стоит за этим): обработка запросов, логика запросов, маршрутизация  
AI: анализ ответов, базы знаний и генерация рекомендаций  
База знаний: правила, статьи, шаблоны советов (собраны заранее)  
Уведомления: напоминания (поставить эмоции за день, написать заметки и остальное для сбора данных) и подписки/какое количество человек используют  
Админ-панель: управление контентом (рассылки) и пользователями (доступы, выдача токенов, отслеживание вопросов)  
Monitoring / Logging / Alerting: контроль качества платформы и отслеживание её состояния  
  
## Ожидаемые нагрузки  
Стадия 1 - Начальное (MVP): до 100 пользователей  
Стадия 2 - Тестирование партнерами: до 5 000 пользователей  
Стадия 3 - Продовое решение: рост до массовой нагрузки  
Почему так: мы так пытались делать в реальном проекте, а у нас не было IT-специалистов, который бы подсказал, как лучше... но и для учебных гипотез это показательно   

## Этапы и расчеты
**Стадия 1 - Начальное (MVP)**  
Здесь нужна минимальная стоимость и максимально быстрый запуск. Я размышлял, может это как-то с Cloud связать и получилось это: Cloud Run подходит для serverless-запуска и биллинга по факту использования; у него есть бесплатный слой на запросы и вычисления. Cloud Storage тоже дает бесплатный тест-доступ (Free Tier), а Cloud SQL тарифицируется по CPU, памяти, storage, региону и сетевым параметрам


![Картинка](1.png)   
